src/fixtures/fake_payload_from_wsdl.xml

<soap:Envelope
        xmlns:soap="http://www.w3.org/2003/05/soap-envelope"
        xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
        xmlns:tns="http://www.cnamts.fr/webservice"
        xmlns:insi="http://www.cnamts.fr/ServiceIdentiteCertifiee/v1"
        xmlns:insi_recsans_ins="http://www.cnamts.fr/INSiRecSans"
        xmlns:insi_recvit_ins="http://www.cnamts.fr/INSiRecVit"
        xmlns:insi_resultat_ins="http://www.cnamts.fr/INSiResultat"
        xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd"
        xmlns:ctxbam="urn:siram:bam:ctxbam"
        xmlns:ctxlps="urn:siram:lps:ctxlps"
        xmlns:siram="urn:siram"
        xmlns:jaxb="http://java.sun.com/xml/ns/jaxb"
        xmlns:xjc="http://java.sun.com/xml/ns/jaxb/xjc"
        xmlns:wsa="http://www.w3.org/2005/08/addressing">
    <soap:Header>
        <ctxbam:ContexteBAM Version="01_02">
            <ctxbam:Id>c1a2ff23-fc05-4bd1-b500-1ec7d3178f1c</ctxbam:Id>
            <ctxbam:Temps>2021-07-05T13:58:27.452Z</ctxbam:Temps>
            <ctxbam:Emetteur>10B0152872</ctxbam:Emetteur>
            <ctxbam:COUVERTURE/>
        </ctxbam:ContexteBAM>
        <ctxlps:ContexteLPS Nature="CTXLPS" Version="01_00">
            <ctxlps:Id>01f21998-e842-46e9-b4ea-99c15de82e65</ctxlps:Id>
            <ctxlps:Temps>2021-07-05T13:58:27.452Z</ctxlps:Temps>
            <ctxlps:Emetteur>10B0152872</ctxlps:Emetteur>
            <ctxlps:LPS>
                <ctxlps:IDAM R="4">NumAutorisation</ctxlps:IDAM>
                <ctxlps:Version>2022</ctxlps:Version>
                <ctxlps:Instance>b3549edd-4ae9-472a-b26f-fd2fb4ef397f</ctxlps:Instance>
                <ctxlps:Nom>padoa</ctxlps:Nom>
            </ctxlps:LPS>
        </ctxlps:ContexteLPS>
        <wsa:Action>urn:ServiceIdentiteCertifiee:1.0.0:rechercherInsAvecTraitsIdentite</wsa:Action>
        <wsa:MessageID>1f7425e2-b913-415c-adaa-785ee1076a70</wsa:MessageID>
    </soap:Header>
    <soap:Body>
        <insi_recsans_ins:RECSANSVITALE xmlns:insi_recsans_ins="http://www.cnamts.fr/INSiRecSans" xmlns="http://www.cnamts.fr/INSiRecSans">
            <insi_recsans_ins:NomNaissance>ADRDEUX</insi_recsans_ins:NomNaissance>
            <insi_recsans_ins:Prenom>LAURENT</insi_recsans_ins:Prenom>
            <insi_recsans_ins:Sexe>M</insi_recsans_ins:Sexe>
            <insi_recsans_ins:DateNaissance>1981 - 01 - 01</insi_recsans_ins:DateNaissance>
        </insi_recsans_ins:RECSANSVITALE>
    </soap:Body>
</soap:Envelope>
