src/fixtures/fake_payload.xml

<soap:Envelope xmlns:soap="http://www.w3.org/2003/05/soap-envelope" xmlns:urn="urn:siram:bam:ctxbam" xmlns:add="http://www.w3.org/2005/08/addressing" xmlns:urn1="urn:siram:lps:ctxlps" xmlns:oas="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd" xmlns:urn2="urn:oasis:names:tc:SAML:2.0:assertion" xmlns:ins="http://www.cnamts.fr/INSiRecSans">
<soap:Header>
    <urn:ContexteBAM Version="01_02">
        <urn:Id>c1a2ff23-fc05-4bd1-b500-1ec7d3178f1c</urn:Id>
        <urn:Temps>2021-07-05T13:58:27.452Z</urn:Temps>
        <urn:Emetteur>10B0152872</urn:Emetteur>
        <urn:COUVERTURE/>
    </urn:ContexteBAM>
    <add:MessageID>1f7425e2-b913-415c-adaa-785ee1076a70</add:MessageID>
    <add:Action>urn:ServiceIdentiteCertifiee:1.0.0:rechercherInsAvecTraitsIdentite</add:Action>
    <urn1:ContexteLPS Nature="CTXLPS" Version="01_00">
        <urn1:Id>01f21998-e842-46e9-b4ea-99c15de82e65</urn1:Id>
        <urn1:Temps>2021-07-05T13:58:27.452Z</urn1:Temps>
        <urn1:Emetteur>10B0152872</urn1:Emetteur>
        <urn1:LPS>
            <urn1:IDAM R="4">NumAutorisation</urn1:IDAM>
            <urn1:Version>2022</urn1:Version>
            <urn1:Instance>b3549edd-4ae9-472a-b26f-fd2fb4ef397f</urn1:Instance>
            <urn1:Nom>padoa</urn1:Nom>
        </urn1:LPS>
    </urn1:ContexteLPS>
    <oas:Security>
        <!--Empty-->

    </oas:Security>
</soap:Header>
<soap:Body>
    <ins:RECSANSVITALE>
        <ins:NomNaissance>ADRDEUX</ins:NomNaissance>
        <ins:Prenom>LAURENT</ins:Prenom>
        <ins:Sexe>M</ins:Sexe>
        <ins:DateNaissance>1981-01-01</ins:DateNaissance>
    </ins:RECSANSVITALE>
</soap:Body>
</soap:Envelope>
